{
	"posts" : [
	{"postDate":"May 25th, 2016", "postTitle":"All Nighter Over", "postContent":"Just pulled that all-nighter I was talking about. I'll be tired, but it was definitely worth it. I was able to get a lot accomplished and it will help me greatly in the long run. But now I have to get ready for work. Hopefully I won't be at this job for too much longer. Still have my fingers crossed for Delta Defense.", "postAuthor":"Joshua Motl"},
	{"postDate":"May 25th, 2016", "postTitle":"Day Before Graduation", "postContent":"So today was our last full day of class. All we have left tomorrow is our final project presentations. I'm going to be pulling an all nighter in an attempt to clean up some old projects and boost my final grade. I feel very confident moving forward that I will be a successful programmer where it is I get hired. Time to start my life as a developer!", "postAuthor":"Joshua Motl"},
	{"postDate":"May 25th, 2016", "postTitle":"First Interview", "postContent":"I interviewed for Delta Defense today. The place was amazing. They refer to it as 'Google with Guns' which sounds like the absolute perfect fit for me. I feel like the interview went very well and that I was confident in all of my answers. They said they would be hoping to have a decision by Friday, so we'll see. FIngers crossed.", "postAuthor":"Joshua Motl"},
	{"postDate":"April 19th, 2016", "postTitle":"Declarations VS Expressions", "postContent":"I recently read 'Function Declaration vs. Function Expressions' on javascriptweblog.wordpress.com. This article explained the differences between Function Declarations and Expressions. A Function Declaration defines a named function variable without requiring variable assignment. Function Declarations occur as standalone constructs and cannot be nested within non-function blocks. A Function Expression defines a function as a part of a larger expression syntax (typically a variable assignment ). Functions defined via Functions Expressions can be named or anonymous. I read this article to further my knowledge of javascript and to fully comprehend this subject.", "postAuthor":"Joshua Motl"},
	{"postDate":"April 19th, 2016", "postTitle":"Undestanding 'This'", "postContent":"I recently read 'Understand JavaScript’s “this” With Clarity, and Master It' from the javascriptissexy.com blog. This article explained all about 'this' in javascript functions. We use 'this' almost like a pronoun is used in the English language. 'This' is a shortcut or referant to an object. I read this article as an assignment, but am very glad that I did because it was extremely informative.", "postAuthor":"Joshua Motl"},
	{"postDate":"April 10th, 2016", "postTitle":"Future Post", "postContent":"Today, I finalzed my styles for the entire site. I cleaned up the images and added SEO. SEO is important to add so that a website can be easily found through search engines. It helps increase traffic to your site. After adding the SEO I verified that the functionality of the entire site was working properly.", "postAuthor":"Joshua Motl"},
	{"postDate":"April 9th, 2016", "postTitle":"Blast into the Past", "postContent":"While today is actually April 9th, this post is about the events that took place on April 8th. On that day, my site started to really take shape. I set up my folder structure and then began to add some content to the pages. I started by adding a carousel banner and navbar from bootstrap to my index. I then added a projects page and included my ecommerce project. MY next step was to begin planning out my styles.", "postAuthor":"Joshua Motl"},
	{"postDate":"April 9th, 2016", "postTitle":"Creation of Blog", "postContent":"This is my first blog post. I've never blogged before so I'm not really sure what I should be posting. Today, I'm working on creating the blog page for my GitHub Portfolio. It uses AJAX to select and display blog posts from a JSON file. Once I have that all working I hope to clean up my CSS. I really struggle with CSS as I'm a fan of very bright colors, which tend to make websites look a tad childish. I hope to find a happy medium that allows me to use the bright colors that I enjoy while also maintaining a level of professionalism. Much easier said than done. Wish me luck.", "postAuthor":"Joshua Motl"}
	]
}
